cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

# Utils
brew 'ack'
brew 'tmux'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'go'
brew 'grc'
brew 'gnupg'
brew 'gpg-agent'
brew 'pinentry-mac'
brew 'jq'
brew 'git'
brew 'git-extras'
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'unrar'
brew 'wget'
brew 'curl'
brew 'mtr'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'jq'
brew 'autojump'
brew 'the_silver_searcher'
brew 'nmap'
brew 'yarn'
brew 'reattach-to-user-namespace'

# Applications
cask '1password'
cask 'google-chrome'
cask 'slack'
cask 'atom'
cask 'visual-studio-code'
cask 'steam'
cask 'transmission'
cask 'vlc'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
